// объявляем переменную для вывода сообщения
let message;

// объявляем переменную для ввода фамилии
let lastName = prompt('Введите Вашу фамилию');

// проверяем на корректность введенные данные:
if  (!/^[а-яА-ЯёЁ -]{3,30}$/.test(lastName) || !lastName || lastName===""){
    message = "Вы не корректно указали фамилию. Допускается ввод только кириллицы от 3 до 30 символов";
    }
    else{

// объявляем переменную для ввода имени
let firstName = prompt('Введите Ваше имя');

// проверяем на корректность введенные данные:
if  (!/^[а-яА-ЯёЁ -]{3,30}$/.test(firstName) || !firstName || firstName===""){
    message = "Вы не корректно указали имя. Допускается ввод только кириллицы  от 3 до 30 символов";
    }
    else{

// объявляем переменную для ввода отчества
let patronymic = prompt('Введите Ваше отчество');

// проверяем на корректность введенные данные:
if  (!/^[а-яА-ЯёЁ -]{3,30}$/.test(patronymic) || !patronymic || patronymic===""){
    message = "Вы не корректно указали отчество. Допускается ввод только кириллицы  от 3 до 30 символов";
    }
    else{

// объявляем переменную для ввода возраста и преобразовываем тип переменной  в number    
let age = prompt('Сколько Вам лет?');
let nAge = Number(age);  

//объявляем переменную и запрещаем ввод любого сивола кроме цифр от 0 до 9
let rep = /[^0-9]/;

// проверяем на корректность введенные данные:
//если возраст меньше 18, больше 120 или поле содержит недопустимые символы, тогда выводится сообщение о некорректных данных
if (rep.test(nAge) || nAge<=17 || nAge>=121 || nAge==="")

   {
        message = "Возраст должен быть указан между цифрами 18 и 120";
        }
        else{ 


// объявляем переменную для возраста в днях и присваиваем ей значение переменной age умноженное на количество дней в году
let ageInDays = nAge * 365;

// объявляем переменную для возраста через 5 лет и присваиваем ей значение: 5 лет + переменная age
let ageIn5Years = 5+nAge;

//определяем пол и пенсионный возраст
// объявляем переменную для пола
let gender = confirm("Если Ваш пол мужской нажмите ОК, если женский - Отмена");
// объявляем новую переменную для пола и присваиваем ей значение "женский"
let sGender = "Женский";
// объявляем переменную для пенсионного возраста и присваиваем ей женский пенсионный возраст
let pensionAge = 58;
// если пользователь нажимает ок, то переменной gender (она boolean) возвращается true и выполняется условие в фигурных скобках (в sGender присваивается Мужской, в pensionAge 63 - возраст выхода мужчин на пенсию)
// если пользователь нажимает cancel, то переменной gender (она boolean) возвращается false и условия в фигурных скобках не выполняются
if  (gender){sGender="Мужской";
pensionAge = 63;}

// объявляем переменную для определения пенсии. 
// при помощи тернарного оператора определяем пенсионер или нет. если  введенный возраст меньше пенсионного возраста, тогда выводится "нет". если введенный возраст больше пенсионного возраста, тогда выводится "да"
let pension = "Вы на пенсии: "+(age<pensionAge?"нет":"да"); 

// присваиваем переменной message информацию о пользователе
message='Ваше ФИО: ' + lastName +' ' + firstName +' ' + patronymic +'\n'+ 'Ваш возраст в годах: ' + nAge +'\n'+ 'Ваш возраст в днях: ' + ageInDays +'\n'+ 'Через 5 лет Вам будет: ' + ageIn5Years +'\n'+ 'Ваш пол: ' + sGender+ '\n'+pension;

    }}}}

// выводим сообщение с информацией о пользователе
alert(message);